Repository: KDE/kde-cli-tools
Catalog: po/sa/kioclient.po
Languages: sa

# NAME OF TRANSLATORS
source: Your names
sa: श्रीकान्त् कलवार्

# EMAIL OF TRANSLATORS
source: Your emails
sa: skkalwar999@gmail.com

source: Syntax:
sa: वाक्य रचना : १.

# The argument is the command "kioclient openProperties"
source: %1 'url' # Opens a properties dialog of 'url'
sa: %1 'url'. # 'url' इत्यस्य गुणसंवादं उद्घाटयति ।

# The argument is the command "kioclient exec"
source: %1 'url' ['mimetype'] # Tries to open the document pointed to by 'url', in the application # associated with it in KDE. You may omit 'mimetype'. # In that case the mimetype is determined automatically. # 'url' can be the URL of a document, a *.desktop file, # or an executable.
sa: %1 'url' ['mimetype'] । # 'url' द्वारा सूचितं दस्तावेजं उद्घाटयितुं प्रयतते, अनुप्रयोगे # KDE मध्ये तया सह सम्बद्धम् । भवन्तः 'mimetype' इति परित्यक्तुं शक्नुवन्ति । # तस्मिन् सति अनुकरणप्रकारः स्वयमेव निर्धारितः भवति । # 'url' दस्तावेजस्य URL, *.desktop सञ्चिका, . # अथवा कार्यान्वयनीयः ।

# The argument is the command "kioclient move"
source: %1 'src' 'dest' # Moves the URL 'src' to 'dest'. # 'src' may be a list of URLs. # 'dest' may be "trash:/" to move the files to the trash. # The short version 'kioclient mv' is also available.
sa: %1 'src' 'dest'. # URL 'src' 'dest' मध्ये स्थानान्तरयति । # 'src' URL-सूची भवितुम् अर्हति । # 'dest' सञ्चिकाः कचरे स्थानान्तरयितुं "trash:/" भवितुम् अर्हति । # 'kioclient mv' इति लघुसंस्करणम् अपि उपलभ्यते ।

# The argument is the command "kioclient download"
source: %1 ['src'] # Copies the URL 'src' to a user-specified location. # 'src' may be a list of URLs, if not present then # a URL will be requested.
sa: %1 ['src'] । # URL 'src' इत्यस्य प्रतिलिपिं उपयोक्तृनिर्दिष्टस्थाने करोति । # 'src' URL-सूची भवितुम् अर्हति, यदि तदा उपस्थिता नास्ति # एकं URL अनुरोधितं भविष्यति।

# The argument is the command "kioclient copy"
source: %1 'src' 'dest' # Copies the URL 'src' to 'dest'. # 'src' may be a list of URLs. # The short version 'kioclient cp' is also available.
sa: %1 'src' 'dest'. # URL 'src' 'dest' इति प्रतिलिपिं करोति । # 'src' URL-सूची भवितुम् अर्हति । # 'kioclient cp' इति लघुसंस्करणम् अपि उपलभ्यते ।

# The argument is the command "kioclient cat"
source: %1 'url' # Prints the contents of the file 'url' to the standard output
sa: %1 'url'. # 'url' सञ्चिकायाः सामग्रीं मानकनिर्गमं प्रति मुद्रयति

# The argument is the command "kioclient ls"
source: %1 'url' # Lists the contents of the directory 'url' to stdout
sa: %1 'url'. # 'url' इति निर्देशिकायाः सामग्रीं stdout मध्ये सूचीबद्धं करोति

# The argument is the command "kioclient remove"
source: %1 'url' # Removes the URL # 'url' may be a list of URLs. # The short version 'kioclient rm' is also available.
sa: %1 'url'. # URL निष्कासयति # 'url' URL-सूची भवितुम् अर्हति । # 'kioclient rm' इति लघुसंस्करणम् अपि उपलभ्यते ।

# The argument is the command "kioclient stat"
source: %1 'url' # Shows all of the available information for 'url'
sa: %1 'url'. # 'url' कृते उपलब्धानि सर्वाणि सूचनानि दर्शयति।

# The argument is the command "kioclient appmenu"
source: %1 # Opens a basic application launcher
sa: %1 # एकं मूलभूतं अनुप्रयोगप्रक्षेपकं उद्घाटयति

source: *** Examples:
sa: *** उदाहरणानि : १.

source: kioclient exec file:/home/weis/data/test.html // Opens the file with the default application associated // with this MimeType
sa: kioclient exec सञ्चिका:/home/weis/data/test.html // सम्बद्धेन पूर्वनिर्धारित-अनुप्रयोगेन सह सञ्चिकां उद्घाटयति // अस्मिन् MimeType इत्यनेन सह

source: kioclient exec ftp://localhost/ // Opens URL with the default handler for ftp:// scheme
sa: kioclient exec ftp://स्थानीयमेजबान/ // ftp:// योजनायाः पूर्वनिर्धारित-हन्डलर-सहितं URL उद्घाटयति

source: kioclient exec file:/root/Desktop/emacs.desktop // Starts emacs
sa: kioclient exec सञ्चिका:/मूल/डेस्कटॉप/emacs.desktop // emacs आरभते

source: kioclient exec . // Opens the current directory in the default // file manager. Very convenient.
sa: kioclient exec . // पूर्वनिर्धारितरूपेण वर्तमाननिर्देशिकां उद्घाटयति // सञ्चिकाप्रबन्धकः। अतीव सुविधाजनकम्।

source: Command-line tool for network-transparent operations
sa: जाल-पारदर्शक-सञ्चालनानां कृते आदेश-पङ्क्ति-उपकरणम्

source: Use message boxes and other native notifications
sa: सन्देशपेटिकाः अन्ये च देशीसूचनाः उपयुज्यताम्

source: Non-interactive use: no message boxes. If you don't want a graphical connection, use --platform offscreen
sa: अ-अन्तरक्रियाशीलः उपयोगः : सन्देशपेटिकाः नास्ति । यदि भवान् चित्रात्मकं संयोजनं न इच्छति तर्हि --platform offscreen इत्यस्य उपयोगं कुर्वन्तु

source: Overwrite destination if it exists (for copy and move)
sa: गन्तव्यं यदि अस्ति तर्हि अधिलेखयन्तु (प्रतिलिपिं चालयितुं च)

source: file or URL
sa: सञ्चिका अथवा URL

source: Source URL or URLs
sa: स्रोतः URL अथवा URLs

source: Destination URL
sa: गन्तव्यस्थानस्य URL

source: Show available commands
sa: उपलब्धानि आदेशानि दर्शयन्तु

source: Command (see --commands)
sa: आदेशः (द्रष्टव्यम् --आदेशाः)

source: command
sa: आदेश

source: Arguments for command
sa: आज्ञार्थं तर्काः

# @info:shell
source: %1: Syntax error, not enough arguments
sa: %1: वाक्यविन्यासदोषः, पर्याप्ताः तर्काः नास्ति

# @info:shell
source: %1: Syntax error, too many arguments
sa: %1: वाक्यविन्यासदोषः, अत्यधिकाः तर्काः

source: Destination where to download the files
sa: गन्तव्यं यत्र सञ्चिकाः अवतरणं कर्तव्यम्

# @info:shell
source: %1: Syntax error, unknown command '%2'
sa: %1: वाक्यविन्यासदोषः, अज्ञातः आदेशः '%2' ।
