Repository: KDE/kde-cli-tools
Catalog: po/*/kbroadcastnotification.po
Languages: ar, eo, is

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
eo: Oliver Kellogg
is: Sveinn í Felli

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
eo: olivermkellogg@gmail.com
is: sv1@fellsnet.is

source: Broadcast Notifications
ar: بث الإشعارات
eo: Elsendaj Sciigoj
is: Útvarpa tilkynningum

source: A tool that emits a notification for all users by sending it on the system DBus
ar: أداة تبث الإشعارات لكل المستخدمين عن طريق إرسالها في باص النظام
eo: Ilo kiu elsendas sciigon por ĉiuj uzantoj sendante ĝin sur la sistemo DBus
is: Verkfæri sem sendir út tilkynningu til allra notenda með því að senda hana á DBus-rás kerfisins

source: (c) 2016 Kai Uwe Broulik
ar: (c) 2016 كاي أووي بروليك

source: Name of the application that should be associated with this notification
ar: اسم التطبيق المراد ربطه بهذا الإشعار
eo: Nomo de la aplikaĵo, kiu devus esti asociita kun ĉi tiu sciigo
is: Nafnið á forritinu sem ætti að tengjast þessari tilkynningu

source: A brief one-line summary of the notification
ar: ملخص من سطر واحد لهذا الإشعار
eo: Mallonga unulinia resumo de la sciigo
is: Stutt einnar-línu samantekt um tilkynninguna

source: Icon for the notification
ar: أيقونة الإشعار
eo: Piktogramo por la sciigo
is: Táknmynd tilkynningar

source: A comma-separated list of user IDs this notification should be sent to. If omitted, the notification will be sent to all users.
ar: قائمة بمعرفات المستخدمين مفصولة بفاصلة الذين سيستلموا هذا الإشعار. إذا لم تحدد سيرسل إلى جميع المستخدمين.
eo: Komo-separata listo de uzantidentigiloj, al kiu ĉi tiu sciigo estu sendita. Se ellasita, la sciigo estos sendita al ĉiuj uzantoj.
is: Kommu-aðgreindur listi yfir auðkenni þeirra notenda sem ættu að fá tilkynninguna senda. Ef þessu er sleppt fer tilkynningin til allra notenda.

source: Timeout for the notification
ar: مهلة الإشعار
eo: Tempo por la sciigo
is: Tímamörk fyrir tilkynninguna

source: Keep the notification in the history until the user closes it
ar: أبقِ الإشعار في التاريخ حتى يغلقه المستخدم
eo: Konservi la sciigon en la historio ĝis la uzanto fermas ĝin
is: Halda tilkynningu í tilkynningaferlinum þar til notandinn lokar henni

source: The actual notification body text
ar: نص محتوى الفعلي للإشعار
eo: La fakta avizkorpa teksto
is: Raunverulegt meginmál tilkynningarinnar
