Repository: KDE/kde-cli-tools
Catalog: po/*/kcm_filetypes.po
Languages: lv, ro

# NAME OF TRANSLATORS
source: Your names
lv: Andris Maziks, Māris Nartišs, Viesturs Zariņš
ro: Claudiu Costin,Bogdan Daniel Vatră,Laurențiu Buzdugan,Sergiu Bivol

# EMAIL OF TRANSLATORS
source: Your emails
lv: andris.m@delfi.lv, maris.kde@gmail.com, viesturs.zarins@mii.lu.lv
ro: ,taipanromania@xnet.ro,lbuz@rolix.org,sergiu@cip.md

source: Left Click Action (only for Konqueror file manager)
lv: Kreisā klišķa darbība (tikai Konqueror datņu pārlūkam)
ro: Acțiune clic stânga (doar pentru gestionarul de fișiere Konqueror)

source: Show file in embedded viewer
lv: Rādīt datni iegultajā skatītājā
ro: Arată fișierul într-un vizualizor înglobat

source: Show file in separate viewer
lv: Rādīt datni atsevišķā skatītājā
ro: Arată fișierul într-un vizualizor separat

source: Here you can configure what the Konqueror file manager will do when you click on a file belonging to this group. Konqueror can display the file in an embedded viewer or start up a separate application. You can change this setting for a specific file type in the 'Embedding' tab of the file type configuration. Dolphin shows files always in a separate viewer
lv: Šeit jūs varat konfigurēt, ko darīs Konqueror datņu pārvaldnieks, kad jūs noklikšķiniet uz datnes, kas pieder šai grupai. Konqueror var parādīt datni iegultajā skatītājā vai palaist atsevišķu programmu. Jūs varat mainīt šos iestatījumus konkrētam datnes tipam ’Iegulšanas’ cilnē datnes tipa konfigurācijā. Dolphin vienmēr rāda datni atsevišķā skatītājā.
ro: Aici puteți configura ce va face Konqueror când faceți clic pe un fișier aparținând acestui grup. Konqueror poate afișa fișierul într-un vizualizor înglobat sau poate porni o aplicație separată. Puteți schimba această setare pentru un tip de fișier specificat, selectând sub-fereastra „Înglobat” a configurării tipurilor de fișiere. Dolphin arată întotdeauna fișierele într-un vizualizor separat.

source: This button displays the icon associated with the selected file type. Click on it to choose a different icon.
lv: Šī poga rāda izvēlētās datnes tipa ikonu. Klikšķiniet uz tās, lai to nomainītu pret citu ikonu.
ro: Acest buton afișează pictograma asociată cu tipul de fișier ales. Apăsați-l pentru a alege o pictogramă diferită.

source: Filename Patterns
lv: Datņu nosaukumu šabloni
ro: Modele de denumiri de fișier

source: This box contains a list of patterns that can be used to identify files of the selected type. For example, the pattern *.txt is associated with the file type 'text/plain'; all files ending in '.txt' are recognized as plain text files.
lv: Šablonu saraksts, kas var tikt izmantoti, lai identificētu izvēlētā tipa datnes. Piemērām , šablons '*.txt' ir piesaistīts datņu tipam ’text/plain’; visas datnes, kas beidzas ar ’.txt’, tiek noteiktas kā vienkāršas teksta datnes.
ro: Această zonă conține o listă de modele care sunt utilizate la identificarea fișierelor pentru tipul selectat. De exemplu, modelul *.txt este asociat cu tipul de fișier „text/plain”. Astfel, toate fișierele terminate în „.txt” vor fi recunoscute ca fișiere de text simplu.

source: Add...
lv: Pievienot...
ro: Adaugă...

source: Add a new pattern for the selected file type.
lv: Pievienot jaunu šablonu izvēlētajam datņu tipam.
ro: Adaugă un nou model pentru tipul de fișier ales.

source: Remove
lv: Izņemt
ro: Elimină

source: Remove the selected filename pattern.
lv: Aizvākt izvēlēto datņu nosaukuma šablonu.
ro: Elimină modelul de fișier ales.

source: Description:
lv: Apraksts:
ro: Descriere:

source: You can enter a short description for files of the selected file type (e.g. 'HTML Page'). This description will be used by applications like Konqueror to display directory content.
lv: Jūs varat ievadīt īsu aprakstu izvēlētā tipa datnei (piem. 'HTML Lapa'). Šo aprakstu izmantos Konqueror līdzīgas programmas, lai parādītu mapes saturu.
ro: Aici puteți să scrieți o scurtă descriere pentru fișierele de tipul ales (de exemplu „Pagină HTML”). Această descriere va fi folosită de aplicații precum Konqueror atunci când afișează conținutul unui dosar.

source: Left Click Action in Konqueror
lv: Kreisā klikšķa darbība iekš Konqueror
ro: Acțiune clic stânga în Konqueror

source: Ask whether to save to disk instead (only for Konqueror browser)
lv: Pajautāt vai tā vietā saglabāt uz diska (tikai Konqueror pārlūkam)
ro: Întreabă dacă fișierul să fie salvat pe disc (numai în navigatorul Konqueror)

source: Here you can configure what the Konqueror file manager will do when you click on a file of this type. Konqueror can either display the file in an embedded viewer, or start up a separate application. If set to 'Use settings for G group', the file manager will behave according to the settings of the group G to which this type belongs; for instance, 'image' if the current file type is image/png. Dolphin always shows files in a separate viewer.
lv: Šeit jūs varat konfigurēt, ko darīs Konqueror datņu pārvaldnieks, kad jūs noklikšķiniet uz šī tipa datnes. Konqueror datņu pārlūks var parādīt datni iegultajā skatītājā vai palaist atsevišķu programmu. Ja iestatīts 'Izmantot G grupas iestatījumus', datņu pārlūks uzvedīsies atbilstoši grupas G iestatījumiem, kam šis tips pieder, piem. ierakstam 'attēls', ja pašreizējās datnes tips ir image/png. Dolphin vienmēr rāda datnes atsevišķā skatītājā.
ro: Aici puteți configura ce va face Konqueror când apăsați pe un fișier aparținând acestui tip. Konqueror poate afișa fișierul într-un vizualizor înglobat sau poate porni o aplicație separată. Dacă este lăsat la „Folosește configurările grupului G”, Konqueror se va comporta în conformitate cu configurările grupului G de care aparține fișierul, ca de exemplu „image” dacă tipul de fișier actual este „image/png”. Dolphin afișează fișierele întotdeauna într-un vizualizor separat.

source: &General
lv: &Pamata
ro: &Generale

source: &Embedding
lv: &Iegulšana
ro: Î&nglobat

source: Add New Extension
lv: Pievienot jaunu paplašinājumu
ro: Adaugă o extensie nouă

source: Extension:
lv: Paplašinājums:
ro: Extensie:

source: File type %1
lv: Datnes tips %1
ro: Tip fișier %1

source: Use settings for '%1' group
lv: Izmantot iestatījumus '%1' grupai
ro: Folosește configurările grupului „%1”

source: Search for file type or filename pattern...
lv: Meklēt datnes tipu vai nosaukuma šablonu...
ro: Caută după tip de fișier sau model de denumire...

source: Enter a part of a filename pattern, and only file types with a matching file pattern will appear in the list. Alternatively, enter a part of a file type name as it appears in the list.
lv: Ievadiet datnes nosaukuma šablona fragmentu. Tikai datņu tipi ar atbilstošu datņu šablonu parādīsies sarakstā. Varat ievadīt arī datnes tipa fragmentu kā tas ir redzams sarakstā.
ro: Introduceți o parte a șablonului de denumire, și în listă vor apărea numai tipurile de fișier care se potrivesc cu șablonul. Suplimentar, puteți introduce o parte din denumirea tipului de fișier așa cum apare în listă.

source: Known Types
lv: Zināmie tipi
ro: Tipuri cunoscute

source: Here you can see a hierarchical list of the file types which are known on your system. Click on the '+' sign to expand a category, or the '-' sign to collapse it. Select a file type (e.g. text/html for HTML files) to view/edit the information for that file type using the controls on the right.
lv: Šeit jūs varat redzēt hierarhisku datņu tipu sarakstu, kuri ir zināmi jūsu sistēmai. Nospiediet uz '+' zīmes, lai izvērstu kategoriju vai uz '-' zīmes lai sakļautu to. Izvēlieties datnes tipu (piem. text/html HTML datnēm), lai skatītu/rediģētu informāciju par datnes tipu izmantojot vadības rīkus labajā pusē.
ro: Aici puteți vedea o listă ierarhică a tipurilor de fișiere instalate pe sistemul dumneavoastră. Dați clic pe semnul "+" pentru a expanda o categorie sau pe "-" pentru a o contrage. Selectați un tip de fișier (de exemplu "text/html" pentru fișiere HTML) pentru a-l edita utilizând controalele din partea dreaptă.

source: Click here to add a new file type.
lv: Spiediet šeit, lai pievienotu jaunu datnes tipu.
ro: Apăsați aici pentru a adăuga un tip nou de fișier.

source: &Remove
lv: &Izņemt
ro: &Elimină

source: Select a file type by name or by extension
lv: Izvēlieties datnes tipu pēc nosaukuma vai pēc paplašinājuma
ro: Alegeți un tip de fișier după denumire sau extensie

source: &Revert
lv: &Atgriezt
ro: &Restabilește

source: Revert this file type to its initial system-wide definition
lv: Atgriezt šo datnes tipu tā sākotnējā, sistēmas definētajā stāvoklī
ro: Restabilește acest tip de fișier la definiția sa inițială din sistem

source: Click here to revert this file type to its initial system-wide definition, which undoes any changes made to the file type. Note that system-wide file types cannot be deleted. You can however empty their pattern list, to minimize the chances of them being used (but the file type determination from file contents can still end up using them).
lv: Spiediet šeit, lai šo datnes tipu atgrieztu tā sākotnējā, sistēmas definētajā stāvoklī. Tas atceļ visas ar šo tipu veiktās izmaiņas. Ņemiet vērā,ka sistēmas definētos datņu tipus nevar izdzēst. Bet iespējams tiem iestatīt tukšu šablonu sarakstu, tādējādi minimizējot to lietojumu (tie tomēr tiks lietoti, nosakot balstoties uz datnes saturu).
ro: Apăsați aici pentru a reveni la definiția de sistem inițială a acestui tip de fișier, ceea ce desface orice modificare făcută de dumneavoastră tipului de fișier. Rețineți faptul că tipurile de fișier definite de sistem nu pot fi șterse. Puteți totuși să le goliți modelele de denumiri pentru a minimiza șansa utilizării lor (totuși procedura de determinare a tipului fișierului bazată pe conținutul acestuia poate să ajungă să le folosească).

source: Delete this file type definition completely
lv: Pilnībā izdzēst datnes tipa definīciju
ro: Șterge complet definiția acestui tip de fișier

source: Click here to delete this file type definition completely. This is only possible for user-defined file types. System-wide file types cannot be deleted. You can however empty their pattern list, to minimize the chances of them being used (but the file type determination from file contents can still end up using them).
lv: Spiediet šeit, lai izdzēstu datnes tipa definīciju. Tas pieejams tikai lietotāja definētiem datņu tipiem. Sistēmas datņu tipus nevar izdzēst. Bet iespējams tiem iestatīt tukšu šablonu sarakstu, tādējādi minimizējot to lietojumu (tie tomēr tiks lietoti, nosakot balstoties uz datnes saturu).
ro: Apăsați aici pentru a șterge definiția acestui tip de fișier. Această operație e posibilă doar pentru definițiile de tip de fișier ale utilizatorului. Tipurile de fișier definite de sistem nu pot fi șterse. Puteți totuși să le ștergeți modelele de denumiri pentru a minimiza șansa utilizării lor (dar procedura de determinare a tipului fișierului bazată pe conținutul acestuia poate să ajungă să le folosească).

source: File Type Editor
lv: Datņu tipu redaktors
ro: Redactor tipuri de fișiere

source: KDE file type editor - simplified version for editing a single file type
lv: KDE datņu tipa redaktors - vienkāršota versija vienas datnes tipa labošana
ro: Redactor tipuri de fișiere pentru KDE - versiune simplificată pentru redactarea unui singur tip de fișier

source: (c) 2000, KDE developers
lv: (c) 2000, KDE Izstrādātāji
ro: (c) 2000, Programatorii KDE

source: Makes the dialog transient for the window specified by winid
lv: Padara dialogu īslaicīgu winid norādītajam logam
ro: Face ca dialogul să fie temporar pentru fereastra cu „winid”-ul specificat

source: File type to edit (e.g. text/html)
lv: Labojamais datnes tips (piem. text/html)
ro: Tipul de fișier de modificat (de ex. text/html)

source: %1 File
lv: %1 datne
ro: Fișier %1

source: Edit File Type %1
lv: Rediģēt datnes tipu %1
ro: Modificare tip de fișier %1

source: Create New File Type %1
lv: Veidot jaunu datnes tipu %1
ro: Creează tip de fișier nou %1

source: Application Preference Order
lv: Programmu izvēles kārtība
ro: Ordinea preferată a aplicațiilor

source: Services Preference Order
lv: Servisu izvēles kārtība
ro: Ordinea preferată a serviciilor

source: This is a list of applications associated with files of the selected file type. This list is shown in Konqueror's context menus when you select "Open With...". If more than one application is associated with this file type, then the list is ordered by priority with the uppermost item taking precedence over the others.
lv: Šis ir programmu saraksts, kas piešķirtas izvēlētā tipa datnēm. Šis saraksts parādās Konqueror konteksta izvēlnē, kad jūs izvēlieties "Atvērt ar..." iespēju. Ja datnes tipam ir piešķirtas vairākas programmas, tad saraksts tiek sakārtots pēc prioritātēm, kur augšējam ierakstam ir augstākā prioritāte.
ro: Aceasta este o listă a aplicațiilor asociate cu fișiere ale tipului de fișier ales. Această listă este afișată în meniul contextual al Konqueror atunci când alegeți „Deschide cu...”. Dacă cu acest tip de fișier este asociată mai mult de o aplicație, atunci lista este ordonată după prioritate, cel mai de sus element având precedență față de celelalte.

source: This is a list of services associated with files of the selected file type. This list is shown in Konqueror's context menus when you select a "Preview with..." option. If more than one service is associated with this file type, then the list is ordered by priority with the uppermost item taking precedence over the others.
lv: Šis ir servisu saraksts, ka piešķirti izvēlētā tipa datnēm. Šis saraksts parādās Konqueror konteksta izvēlnē, kad jūs izvēlieties "Priekšskatīt ar..." opciju. Ja datnes tipam ir piešķirti vairāki servisi, tad saraksts tiek sakārtots pēc prioritātēm, kur augšējam ierakstam ir augstākā prioritāte.
ro: Aceasta este o listă a serviciilor asociate cu fișiere ale tipului de fișier ales. Această listă este afișată în meniul contextual al Konqueror atunci când alegeți „Previzualizează cu...”. Dacă cu acest tip de fișier este asociat mai mult de un serviciu, atunci lista este ordonată după prioritate, cel mai de sus element având precedență față de celelalte.

source: Move &Up
lv: Pārvietot &uz augšu
ro: Mută mai s&us

source: Assigns a higher priority to the selected application, moving it up in the list. Note: This only affects the selected application if the file type is associated with more than one application.
lv: Piešķir augstāku prioritāti izvēlētajai programmai, pārvietojot to sarakstā uz augšu. Piezīme: Tas ietekmē izvēlēto programmu tikai, ja datnes tipam ir piešķirta vairāk kā viena programma.
ro: Atribuie o prioritate mai mare pentru aplicația aleasă, mutând-o mai sus în listă. Aceasta afectează aplicația aleasă doar dacă tipul de fișier e asociat cu mai mult de o aplicație.

source: Assigns a higher priority to the selected service, moving it up in the list.
lv: Piešķir augstāku prioritāti izvēlētajam servisam, pārvietojot to sarakstā uz augšu.
ro: Atribuie o prioritate mai mare pentru serviciul ales, mutându-l mai sus în listă.

source: Move &Down
lv: Pārvietot uz &leju
ro: Mută mai j&os

source: Assigns a lower priority to the selected application, moving it down in the list. Note: This only affects the selected application if the file type is associated with more than one application.
lv: Piešķir zemāku prioritāti izvēlētajai programmai, pārvietojot to sarakstā uz leju. Piezīme: Tas ietekmē izvēlēto programmu tikai, ja datnes tipam ir piešķirta vairāk kā viena programma.
ro: Atribuie o prioritate mai mică pentru aplicația aleasă, mutând-o mai jos în listă. Aceasta afectează aplicația aleasă doar dacă tipul de fișier e asociat cu mai mult de o aplicație.

source: Assigns a lower priority to the selected service, moving it down in the list.
lv: Piešķir zemāku prioritāti izvēlētajam servisam, pārvietojot to sarakstā uz leju.
ro: Atribuie o prioritate mai mică pentru serviciul ales, mutându-l mai jos în listă.

source: Add a new application for this file type.
lv: Pievienot šim datņu tipam jaunu programmu.
ro: Adaugă o nouă aplicație pentru acest tip de fișier.

source: Edit...
lv: Rediģēt...
ro: Modifică...

source: Edit command line of the selected application.
lv: Rediģēt izvēlētās programmas komandas rindu.
ro: Modifică linia de comandă a aplicației alese.

source: Remove the selected application from the list.
lv: Izņem izvēlēto programmu no saraksta.
ro: Șterge aplicația aleasă din listă.

# No applications associated with this file type
source: None
lv: Nav
ro: Niciuna

# No components associated with this file type
source: None
lv: Nav
ro: Niciuna

source: Add Service
lv: Pievienot servisu
ro: Adaugă serviciu

source: Select service:
lv: Izvēlēties servisu:
ro: Alege serviciul:

source: Create New File Type
lv: Veidot jaunu datņu tipu
ro: Creează tip nou de fișier

source: Group:
lv: Grupa:
ro: Grup:

source: Select the category under which the new file type should be added.
lv: Izvēlieties kategoriju zem kuras pievienot jauno datņu tipu.
ro: Alegeți categoria sub care va fi adăugat noul tip de fișier.

source: Type name:
lv: Tipa nosaukums:
ro: Denumire tip:

source: Type the name of the file type. For instance, if you selected 'image' as category and you type 'custom' here, the file type 'image/custom' will be created.
lv: Ievadiet datnes tipa nosaukumu. Piemēram, ja jūs izvēlaties 'attēls' kā kategoriju un šeit ievadiet 'pielāgots', tad tiks izveidots jauns tips 'attēls/pielāgots'.
ro: Scrieți denumirea tipului de fișier. De exemplu, dacă ați ales „imagine” drept categorie și tastați aici „personalizat”, va fi creat tipul de fișier „imagine/personalizat”.
