Repository: KDE/kde-cli-tools
Catalog: po/*/kioclient.po
Languages: de, fr, nl

# NAME OF TRANSLATORS
source: Your names
de: Deutsches KDE-Übersetzungsteam
fr: Vincent Pinon, Xavier Besnard
nl: Freek de Kruijf - t/m 2022

# EMAIL OF TRANSLATORS
source: Your emails
de: kde-i18n-de@kde.org
fr: vpinon@kde.org, xavier.besnard@kde.org
nl: freekdekruijf@kde.nl

source: Syntax:
fr: Syntaxe :
nl: Gebruik:

# The argument is the command "kioclient openProperties"
source: %1 'url' # Opens a properties dialog of 'url'
de: %1 „url“ # Öffnet ein Eigenschaften-Menü für „url“
fr: %1 « URL » # Ouvre une boite de dialogue de propriétés pour l'URL.
nl: %1 'url' # Opent een eigenschappendialoog van 'url'

# The argument is the command "kioclient exec"
source: %1 'url' ['mimetype'] # Tries to open the document pointed to by 'url', in the application # associated with it in KDE. You may omit 'mimetype'. # In that case the mimetype is determined automatically. # 'url' can be the URL of a document, a *.desktop file, # or an executable.
de: %1 „url“ [„mimetype“] # Versucht, das Dokument unter „url“ mit der in KDE zugewiesenen # Anwendung zu öffnen. „mimetype“ kann dabei ausgelassen werden. # In dem Fall wird der Mimetyp automatisch ermittelt. # Die Adresse kann eine Adresse für ein Dokument oder eine # *.desktop-Datei sein. # Bei „url“ kann es sich auch um eine ausführbare Datei handeln
fr: %1 « URL » [ « type-mime » ] # Essaie d'ouvrir le document vers lequel pointe l'URL dans l'application # lui étant associée dans KDE. Vous pouvez omettre « type-mime ». # Dans ce cas, le type « MIME » est déterminé automatiquement. # L'URL peut être l'emplacement d'un document ou d'un fichier « *.desktop », # ou d'un exécutable.
nl: %1 'url' ['mimetype'] # probeert het document waarnaar 'URL-adres' wijst te # openen in het programma dat ermee is geassocieerd # in KDE. U mag 'mime-type' weglaten. # In dat geval wordt het mime-type automatisch bepaald # 'url' kan de URL van een document zijn, een # *.desktop-bestand of een uitvoerbaar bestand.

# The argument is the command "kioclient move"
source: %1 'src' 'dest' # Moves the URL 'src' to 'dest'. # 'src' may be a list of URLs. # 'dest' may be "trash:/" to move the files to the trash. # The short version 'kioclient mv' is also available.
de: %1 „src“ „dest“ # Verschiebt die URL „src“ nach „dest“. # „src“ kann eine Liste von URLs sein. # „dest“ kann „trash:/“ sein, um die Dateien in den Papierkorb zu verschieben. # Die Kurzversion „kioclient mv“ ist auch verfügbar.
fr: %1 « src » « dest » # Déplace l'URL « src » vers « dest ». # « src » peut être une liste d'URL. # « dest » peut être « trash:/ » pour déplacer les fichiers dans la corbeille. # La version simplifiée de « kioclient mv » est aussi disponible.
nl: %1 'src' 'dest' # Verplaatst de URL 'src' naar 'dest'. # 'src' kan een lijst met URL's zijn. # 'dest' kan "trash:/" zijn om de bestanden naar de $ prullenbak te verplaatsen. # De korte versie 'kioclient mv' is ook beschikbaar.

# The argument is the command "kioclient download"
source: %1 ['src'] # Copies the URL 'src' to a user-specified location. # 'src' may be a list of URLs, if not present then # a URL will be requested.
de: %1 [„quelle“] # Kopiert die Adresse „quelle“ an einen benutzerdefinierten Ort. # „quelle“ kann auch eine Liste von Adressen sein. Ist keine # Adresse angegeben, so wird sie erfragt.
fr: %1 [ « src » ] # Copie l'URL « src » vers un emplacement spécifié par l'utilisateur. # Le paramètre « src » peut être une liste d'URL. Si ce paramètre n'est pas fourni alors # une URL sera demandée.
nl: %1 ['bron'] # Kopieert het URL-adres 'bron' naar een door de gebruiker # opgegeven locatie. # 'bron' mag een lijst van URL-adressen zijn. Indien niet # gegeven zal er om een URL-adres worden gevraagd.

# The argument is the command "kioclient copy"
source: %1 'src' 'dest' # Copies the URL 'src' to 'dest'. # 'src' may be a list of URLs. # The short version 'kioclient cp' is also available.
de: %1 „quelle“ „ziel“ # Kopiert „quelle“ nach „ziel“, # wobei „quelle“ auch eine Liste von Adressen sein kann.
fr: %1 « src » « dest » # Copie l'URL « src » vers « dest ». # « src » peut être une liste d'URL. # La version simplifiée de « kioclient cp » est aussi disponible.
nl: %1 'bron' 'bestemming' # Kopieert het URL-adres 'bron' naar 'bestemming'. # 'bron' mag een lijst van URL-adressen zijn. # De korte versie 'kioclient cp' is ook beschikbaar.

# The argument is the command "kioclient cat"
source: %1 'url' # Prints the contents of the file 'url' to the standard output
de: %1 „url“ # Gibt den Inhalt des Ordners „url“ nach stdout aus
fr: %1 « URL » # Imprime les contenus du fichier « URL » sur le périphérique standard de sortie
nl: %1 'url' # Schrijft de inhoud van het bestand 'url' naar stdout

# The argument is the command "kioclient ls"
source: %1 'url' # Lists the contents of the directory 'url' to stdout
de: %1 „url“ # Gibt den Inhalt des Ordners „url“ nach stdout aus
fr: %1 « URL » # Liste les contenus du dossier « URL » sur le périphérique de sortie
nl: %1 'url' # Schrijft de inhoud van de map 'url' naar stdout

# The argument is the command "kioclient remove"
source: %1 'url' # Removes the URL # 'url' may be a list of URLs. # The short version 'kioclient rm' is also available.
de: %1 „adresse“ # Löscht die Adresse # wobei „adresse“ auch eine Liste von Adressen sein kann.
fr: %1 « URL » # Supprime l'URL # « URL » peut être une liste d'URL. # La version simplifiée de « kioclient rm » est aussi disponible.
nl: %1 'url' # Verwijdert het URL-adres # 'url' mag een lijst van URL-adressen zijn. # De korte versie 'kioclient rm'is ook beschikbaar.

# The argument is the command "kioclient mkdir"
source: %1 'url' # Creates a directory at 'url'
de: %1 „url“ # Erstellt einen Ordner unter „url“
fr: %1 « URL » # Cré un dossier à l'URL.

# The argument is the command "kioclient stat"
source: %1 'url' # Shows all of the available information for 'url'
de: %1 „url“ # Gibt alle verfügbaren Informationen der Adresse „url“ aus
fr: %1 « URL » # Affiche la totalité des informations disponibles concernant « URL ».
nl: %1 'url' # Toont alle beschikbare informatie voor 'url'

# The argument is the command "kioclient appmenu"
source: %1 # Opens a basic application launcher
de: %1 # Öffnet einen einfachen Programmstarter.
fr: %1 # Ouvre un lanceur standard d'applications
nl: %1 # Opent een basis programmastarter.

source: *** Examples:
de: *** Beispiele:
fr: *** Exemples :
nl: *** Voorbeelden:

source: kioclient exec file:/home/weis/data/test.html // Opens the file with the default application associated // with this MimeType
de: kioclient exec file:/home/weis/data/test.html // Öffnet die Datei mit der Standardanwendung, // die dem MIME-Typ zugeordnet ist.
fr: kioclient exec file:/home/weis/data/test.html // Ouvre le fichier avec l'application par défaut, associée // au type « MIME ».
nl: kioclient exec file:/home/gebruiker/data/test.html // opent het bestand met de standaard toepassing // geassocieerd met dit mimetype

source: kioclient exec ftp://localhost/ // Opens URL with the default handler for ftp:// scheme
de: kioclient exec ftp://localhost/ // Öffnet die URL mit dem Standardhandler für das ftp://-Schema.
fr: kioclient exec ftp://localhost/ // Ouvre l'URL avec le gestionnaire par défaut pour le profil « ftp :// ».
nl: kioclient exec ftp://localhost/ // Opent URL-adres met de standaard behandelaar voor // het schema ftp://

source: kioclient exec file:/root/Desktop/emacs.desktop // Starts emacs
de: kioclient exec file:/root/Desktop/emacs.desktop // Startet emacs.
fr: kioclient exec file:/root/Desktop/emacs.desktop // Démarre « emacs »
nl: kioclient exec file:/home/gebruiker/Desktop/emacs.desktop // start het programma Emacs

source: kioclient exec . // Opens the current directory in the default // file manager. Very convenient.
de: kioclient exec . // Öffnet den aktuellen Arbeitsordner im Standard- // Dateiverwaltungsprogramm – sehr komfortabel.
fr: kioclient exec . // Ouvre le dossier courant. dans le gestionnaire de fichiers // par défaut. Très pratique.
nl: kioclient exec . // opent de huidige map in de standaard // bestandsbeheerder. Erg handig.

source: Command-line tool for network-transparent operations
de: Befehlszeilenprogramm für netzwerk-transparente Arbeitsvorgänge
fr: Un outil en ligne de commandes pour les opérations réseau transparentes
nl: Commandoregelprogramma voor netwerktransparante operaties

source: Use message boxes and other native notifications
de: Nachrichtenfenster und andere native Benachrichtigungen verwenden
fr: Utiliser les boites de dialogue et autres notifications natives
nl: Berichtvelden en andere gebruikelijke meldingen gebruiken

source: Non-interactive use: no message boxes. If you don't want a graphical connection, use --platform offscreen
de: Nicht interaktive Anwendung: keine Meldungsfenster. Möchten Sie eine grafische Verbindung, benutzen Sie „--platform offscreen“
fr: Utilisation non interactive : aucune boite de dialogue. Si vous ne voulez aucune connexion graphique, utilisez l'option « --platform offscreen »
nl: Niet-interactief gebruik: geen berichtvelden. Als u geen grafische verbinding wilt, gebruik --platform offscreen

source: Overwrite destination if it exists (for copy and move)
de: Ziel überschreiben, wenn es existiert (für Kopieren und Verschieben)
fr: Écraser la destination si elle existe (pour la copie et le déplacement)
nl: Bestemming overschrijven als deze bestaat (voor kopiÃ«ren en verplaatsten)

source: file or URL
de: Datei oder Adresse
fr: Fichier ou URL
nl: Bestand of URL

source: Source URL or URLs
de: Quell-Adresse(n)
fr: URL(s) de la source
nl: Bron-URL-adres(sen)

source: Destination URL
de: Ziel-Adresse
fr: URL de la destination
nl: URL-adres van bestemming

source: Show available commands
de: Verfügbare Befehle anzeigen
fr: Afficher les commandes disponibles
nl: Beschikbare commando's tonen

source: Command (see --commands)
de: Befehl (siehe --commands)
fr: Commande (voir « --commands »)
nl: Commando (zie --commands)

source: command
de: Befehl
fr: commande
nl: commando

source: Arguments for command
de: Argumente für Befehl
fr: Paramètres de la commande
nl: Argumenten voor commando

# @info:shell
source: %1: Syntax error, not enough arguments
de: %1: Syntaxfehler, zu wenig Argumente
fr: %1 : erreur de syntaxe, pas assez de paramètres
nl: %1: Syntaxisfout: te weinig argumenten

# @info:shell
source: %1: Syntax error, too many arguments
de: %1: Syntaxfehler, zu viele Argumente
fr: %1 : erreur de syntaxe, beaucoup trop de paramètres
nl: %1: Syntaxisfout: te veel argumenten

source: Destination where to download the files
de: Ziel für die heruntergeladenen Dateien
fr: Destination vers laquelle télécharger les fichiers
nl: Bestemming waar vanaf de bestanden te downloaden

# @info:shell
source: %1: Syntax error, unknown command '%2'
de: %1: Syntaxfehler: Unbekannter Befehl „%2“
fr: %1 : erreur de syntaxe, commande « %2 » inconnue
nl: %1: Syntaxisfout: '%2' is een onbekend commando
