Repository: KDE/kde-cli-tools
Catalog: po/*/kstart5.po
Languages: ca@valencia

# NAME OF TRANSLATORS
source: Your names
ca@valencia: SPDX-FileCopyrightText: 2019 Alfredo Vicente,Sebastià Pla i Sanz

# EMAIL OF TRANSLATORS
source: Your emails
ca@valencia: alviboi@gmail.com,sps@sastia.com

source: Utility to launch applications with special window properties such as iconified, maximized, a certain virtual desktop, a special decoration and so on.
ca@valencia: Utilitat per a iniciar aplicacions amb propietats especials de la finestra com ara iconificada, maximitzada, a un cert escriptori virtual, una decoració especial i altres.

source: Command to execute
ca@valencia: Ordre que s'ha d'executar

source: Alternative to <command>: desktop file path to start. D-Bus service will be printed to stdout. Deprecated: use --application
ca@valencia: Alternativa a <ordre>: camí del fitxer «desktop» que s'iniciarà. El servei de D-Bus s'imprimirà a l'eixida estàndard (stdout). Obsolet: utilitzeu «--application»

source: Alternative to <command>: desktop file to start.
ca@valencia: Alternativa a <ordre>: fitxer «desktop» que s'iniciarà.

source: Optional URL to pass <desktopfile>, when using --service
ca@valencia: URL opcional que es passarà <desktopfile>, quan s'utilitza --service

source: A regular expression matching the window title
ca@valencia: Una expressió regular coincident amb el títol de la finestra

source: A string matching the window class (WM_CLASS property) The window class can be found out by running 'xprop | grep WM_CLASS' and clicking on a window (use either both parts separated by a space or only the right part). NOTE: If you specify neither window title nor window class, then the very first window to appear will be taken; omitting both options is NOT recommended.
ca@valencia: Un text coincident amb la classe de finestra (propietat WM_CLASS) La classe de finestra es pot obtindre executant «xprop | grep WM_CLASS» i clicant damunt d'una finestra. (utilitzeu bé les dues parts separades per un espai o bé només la part dreta). NOTA: Si no especifiqueu ni títol de la finestra ni classe de finestra, llavors s'agafarà la primera finestra que aparega; NO es recomana l'omissió d'ambdues opcions.

source: Desktop on which to make the window appear
ca@valencia: Escriptori on es farà aparéixer la finestra

source: Make the window appear on the desktop that was active when starting the application
ca@valencia: Fes aparéixer la finestra en l'escriptori que estava actiu en iniciar l'aplicació

source: Make the window appear on all desktops
ca@valencia: Fes que la finestra aparega en tots els escriptoris

source: Iconify the window
ca@valencia: Iconifica la finestra

source: Maximize the window
ca@valencia: Maximitza la finestra

source: Maximize the window vertically
ca@valencia: Maximitza la finestra verticalment

source: Maximize the window horizontally
ca@valencia: Maximitza la finestra horitzontalment

source: Show window fullscreen
ca@valencia: Mostra la finestra a pantalla completa

source: The window type: Normal, Desktop, Dock, Toolbar, Menu, Dialog, TopMenu or Override
ca@valencia: El tipus de finestra: Normal, Escriptori, Acoblada, Barra d'eines, Menú, Diàleg, Menú superior o Substitució

source: Jump to the window even if it is started on a different virtual desktop
ca@valencia: Passa a la finestra fins i tot si s'inicia en un escriptori virtual diferent

source: Try to keep the window above other windows
ca@valencia: Prova de mantindre la finestra al damunt de les altres

source: Try to keep the window below other windows
ca@valencia: Prova de mantindre la finestra per davall de les altres

source: The window does not get an entry in the taskbar
ca@valencia: La finestra no ix en la barra de tasques

source: The window does not get an entry on the pager
ca@valencia: La finestra no ix al paginador

source: No command specified
ca@valencia: No s'ha especificat cap ordre
